Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Resources that should be removed/hidden from dependencies. This allows for classes and other resources to be removed from dependencies, so they are not accessible to the application. This is a map of artifact key to a comma-separated list of resources to be removed. When running in dev and test mode these resources are hidden from the ClassLoader, when running in production mode these files are removed from the jars that contain them. Note that if you want to remove a class you need to specify the class file name. e.g. to remove com.acme.Foo you would specify com/acme/Foo.class.
ja_jp: 依存関係から削除/非表示にする必要があるリソース。これにより、クラスやその他のリソースを依存関係から削除できるため、アプリケーションからアクセスできなくなります。これは、削除するリソースのコンマ区切りリストへのアーティファクトキーのマップです。開発およびテストモードで実行している場合、これらのリソースは ClassLoader から非表示になり、実稼働モードで実行している場合、これらのファイルはそれらを含む jar から削除されます。クラスを削除する場合は、クラスファイル名を指定する必要があることに注意してください。たとえば、com.acme.Foo を削除するには、com/acme/Foo.class を指定します。

source: Resources:
ja_jp: リソース:

source: Responding with files
ja_jp: ファイルでの応答

source: Response
ja_jp: レスポンス

source: Response body examples
ja_jp: レスポンスボディの例

source: Response filters are **not** invoked on streamed responses, because they would give a false impression that you can set headers or HTTP status codes, which is not true after the initial response. Exception mappers are also not invoked because part of the response may already have been written.
ja_jp: レスポンスフィルターは、ストリーミングされたレスポンスでは呼び出されません。これは、ヘッダーまたは HTTP ステータスコードを設定できるという誤った印象を与えるためです。これは、最初のレスポンスの後では当てはまりません。レスポンスの一部がすでに書き込まれている可能性があるため、例外マッパーも呼び出されません。

source: Response filters are not invoked on streamed responses, because they would give a false impression that you can set headers or HTTP status codes, which is not true after the initial response.
ja_jp: 応答フィルタは、ストリーミングされた応答では呼び出されません。これは、応答フィルタが false を返すためです。 ヘッダーまたは HTTP ステータス コードを設定できるという印象がありますが、最初の応答の後はそうではありません。

source: Response header
ja_jp: レスポンスヘッダー

source: Responses for binary types will be automatically encoded with base64. This is different from the behavior using `quarkus:dev` which will return the raw bytes. Amazon's API has additional restrictions requiring the base64 encoding. In general, client code will automatically handle this encoding but in certain custom situations, you should be aware you may need to manually manage that encoding.
ja_jp: バイナリー型のレスポンスは自動的にbase64でエンコードされます。これは、生のバイトを返す `quarkus:dev` を使用した動作とは異なります。Amazon の API には、base64 エンコーディングを必要とする追加の制限があります。一般的に、クライアントコードは自動的にこのエンコーディングを処理しますが、特定のカスタムな状況では、手動でエンコーディングを管理する必要があるかもしれないことを認識しておく必要があります。

source: Responses for binary types will be automatically encoded with base64. This is different from the behavior using `quarkus:dev`, which will return the raw bytes. Amazon's API has additional restrictions requiring the base64 encoding. In general, client code will automatically handle this encoding, but in certain custom situations, you should be aware you may need to manually manage that encoding.
ja_jp: バイナリー型のレスポンスは自動的にbase64でエンコードされます。これは、生のバイトを返す `quarkus:dev` を使用した動作とは異なります。Amazon の API には、base64 エンコーディングを必要とする追加の制限があります。一般的に、クライアントコードは自動的にこのエンコーディングを処理しますが、特定のカスタムな状況では、手動でエンコーディングを管理する必要があるかもしれないことを認識しておく必要があります。

source: Responses for binary types will be automatically encoded with base64. This is different than the behavior using `quarkus:dev` which will return the raw bytes. Amazon's API has additional restrictions requiring the base64 encoding. In general, client code will automatically handle this encoding but in certain custom situations, you should be aware you may need to manually manage that encoding.
ja_jp: バイナリー型のレスポンスは自動的にbase64でエンコードされます。これは、生のバイトを返す `quarkus:dev` を使用した動作とは異なります。Amazon の API には、base64 エンコーディングを必要とする追加の制限があります。一般的に、クライアントコードは自動的にこのエンコーディングを処理しますが、特定のカスタムな状況では、手動でエンコーディングを管理する必要があるかもしれないことを認識しておく必要があります。

source: Responsive - they must respond in a timely fashion
ja_jp: 応答性 (Responsive) - タイムリーに対応してくれること

source: RestTemplate Example
ja_jp: RestTemplate の例

source: Restart the fist service on the default port 8080 (and note its process id):
ja_jp: fistサービスをデフォルトのポート8080で再起動します（そしてプロセスIDもメモしておきます）。

source: Restart your application while keeping Infinispan server up and running.
ja_jp: Infinispan サーバーを稼働させている間にアプリケーションを再起動します。

source: Restarting Quarkus is not needed, auto-reload should have kicked in and you now can call the http://localhost:8080/hello[`/hello` endpoint] and then see the traces in the Jaeger UI: http://localhost:16686/
ja_jp: Quarkus を再起動する必要はありません。auto-reload が開始され、 http://localhost:8080/hello[`/hello` エンドポイント] を呼び出して、Jaeger UI でトレースを表示できます: http://localhost:16686/

source: Restoration is limited to 2 seconds.
ja_jp: リストアは2秒間に限られます。

source: Restore path after redirect
ja_jp: リダイレクト後のパス復元

source: Restore the original `/protected` request path once the authorization code flow has been complete. You may recall that in the examples with Vert.x OIDC in the <<vertx-oidc-vertx>> and <<vertx-oidc-vertx>> sections, the original request path is restored by default, without users having to do anything at all. However, by default, Quarkus OIDC gives access to the callback resource, `but only after it has completed the authorization code flow`, see the next <<vertx-oidc-to-quarkus-oidc-custom-callback>> section for more details.
ja_jp: 認可コードフローが完了したら、元の `/protected` リクエストパスを復元します。<<vertx-oidc-vertx>> および <<vertx-oidc-vertx>> セクションの Vert.x OIDC の例では、ユーザーが何もする必要なく、デフォルトで元のリクエストパスが復元されたことを思い出すかもしれません。しかし、デフォルトでは、Quarkus OIDC はコールバックリソースへのアクセスを許可しますが、`認可コードフローが完了した後にのみ` 許可します。詳細については、次の <<vertx-oidc-to-quarkus-oidc-custom-callback>> セクションを参照してください。

source: Restrict CSRF token verification
ja_jp: CSRFトークンの検証を制限

source: Restrict supported Origins to trusted Origins only with the xref:security-cors.adoc#cors-filter[CORS filter].
ja_jp: xref:security-cors.adoc#cors-filter[CORS フィルター] を使用して、サポートされている Origin を信頼できる Origin のみに制限します。

source: Restrict supported Origins to trusted Origins only, see xref:security-cors.adoc#cors-filter[CORS filter] section of the "Cross-origin resource sharing" guide for more information.
ja_jp: サポートされるOriginを信頼できるOriginのみに制限してください。詳細については、「Cross-originリソース共有」ガイドの xref:security-cors.adoc#cors-filter[CORSフィルター] のセクションを参照してください。

source: Restrict the `CustomOidcRequestFilter` filter to OIDC tenants `tenant-one` and `tenant-two`.
ja_jp: `CustomOidcRequestFilter` フィルターを OIDC テナント `tenant-one` と `tenant-two` に制限します。

source: Restrict this filter to requests targeting the OIDC client registration endpoint only.
ja_jp: このフィルターを、OIDC クライアント登録エンドポイントのみを対象とするリクエストに制限します。

source: Restrict this filter to requests targeting the OIDC discovery endpoint only.
ja_jp: このフィルターを、OIDC 検出エンドポイントのみを対象とするリクエストに制限します。

source: Restrict this filter to requests targeting the OIDC token endpoint only.
ja_jp: このフィルターを、OIDC トークンエンドポイントのみを対象とするリクエストに制限します。

source: Restrict this filter to requests targeting the registered OIDC client endpoint only.
ja_jp: このフィルターを、登録済み OIDC クライアントエンドポイントのみを対象とするリクエストに制限します。

source: Restricting OIDC request and response filters to authorization code flow
ja_jp: OIDC リクエストフィルターとレスポンスフィルターを認可コードフローに制限する

source: Restricting OIDC request and response filters to bearer token flow
ja_jp: OIDC リクエストおよびレスポンスフィルターをベアラートークンフローに制限する

source: Restricting OIDC request and response filters to specific tenants
ja_jp: OIDC リクエストおよびレスポンスフィルターを特定のテナントに制限する

source: Result
ja_jp: 結果

source: Result metadata
ja_jp: 結果のメタデータ

source: Results
ja_jp: 結果

source: Results are not limited to strings - for example when the server returns JSON payload for each event, Quarkus automatically deserializes it into the generic type used in the `Multi`.
ja_jp: 結果は文字列に限定されません。たとえば、サーバーが各イベントの JSON ペイロードを返すと、Quarkus はそれを `Multi` で使用される汎用型に自動的にデシリアライズします。

source: Resume a specific scheduled method by its identity
ja_jp: スケジュールされた特定のメソッドを、そのIDで再開する

source: Resume the scheduler.
ja_jp: スケジューラーを再開します。

source: Retire and redirect an existing Quarkus AsciiDoc source file
ja_jp: 既存のQuarkus AsciiDocソースファイルの削除とリダイレクト

source: Retiring community UBI 8 images for Quarkus
ja_jp: Quarkus 用コミュニティ版 UBI 8 イメージの提供終了

source: Retrieval
ja_jp: 取得

source: Retrieve SMTP endpoint from https://us-east-1.console.aws.amazon.com/ses/home, example: `email-smtp.us-east-1.amazonaws.com`
ja_jp: SMTPエンドポイントを https://us-east-1.console.aws.amazon.com/ses/home から取得します。例: `email-smtp.us-east-1.amazonaws.com`

source: Retrieve `UserInfo`
ja_jp: `UserInfo` の取得

source: Retrieve a new increment
ja_jp: 新しいインクリメントの取得

source: Retrieve the commands to manipulate the counters
ja_jp: カウンターを操作するためのコマンドを取得します

source: Retrieve the commands to manipulate the keys
ja_jp: キーを操作するコマンドを取得します

source: Retrieve the commands. This time we will manipulate `Long` values
ja_jp: コマンドを取得します。今回は `Long` 値を操作します。

source: Retrieve the counter associated with the given `key`. Return `0L` when no counter is stored.
ja_jp: 与えられた `key` に対応するカウンターを取得します。カウンターが格納されていない場合は、 `0L` を返します。

source: Retrieve the data from one of the three hosts shown in the response (your actual host names will differ):
ja_jp: レスポンスに表示されている 3 つのホストのうちの 1 つからデータを取得します (実際のホスト名は異なります)。

source: Retrieve the incoming channel (`orders`) - the channel must have been switched to in-memory in the test resource.
ja_jp: 着信チャネルを取得します (`orders`) - テストリソース内でチャネルがインメモリーに切り替えられている必要があります。

source: Retrieve the incoming channel (`words-in`)
ja_jp: 着信チャネルの取得 (`words-in`)

source: Retrieve the index.
ja_jp: インデックスを取得します。

source: Retrieve the list of created tasks from the database
ja_jp: 作成されたタスクのリストをデータベースから取得します

source: Retrieve the outgoing channel (`beverages`) - the channel must have been switched to in-memory in the test resource.
ja_jp: 送信チャネルを取得します (`beverages`) - テストリソース内でチャネルがインメモリーに切り替えられている必要があります。

source: Retrieve the outgoing channel (`uppercase`)
ja_jp: 発信チャネルの取得 (`uppercase`)

source: Retrieve the outgoing channel (`words-out`) - the channel must have been switched to in-memory in the test resource.
ja_jp: 発信チャネルの取得 (`words-out`) - テストリソース内でチャネルが in-memory に切り替えられている必要があります。

source: Retrieve the value associated with the given key. It `null`, returns 0.
ja_jp: 与えられたキーに関連する値を取得します `null` の場合は、 0 を返します

source: Retrieves the name of the `Principal`.
ja_jp: `Principal` の名前を取得します。

source: Retrieving a `Cache` from the `CacheManager`
ja_jp: `CacheManager` から `Cache` を取得しています。

source: Retrieving a value if a key is present from a `CaffeineCache`
ja_jp: `CaffeineCache` からすべてのキーを取得する

source: Retrieving all keys from a `CaffeineCache`
ja_jp: `CaffeineCache` からすべてのキーを取得します。

source: Retrying message dispatch
ja_jp: メッセージディスパッチの再試行

source: Retrying processing
ja_jp: 処理のリトライ

source: Return `null` to confirm that this Validator has successfully verified the token.
ja_jp: この Validator がトークンを正常に検証したことを確認するために、 `null` を返します。

source: Return a set of private emails. As in the previous example, you do not have to use `Uni` but having `Uni` aligns better with the JAX-RS method which calls this method and returns a `Uni` response in the `GitHubProfileService` JAX-RS resource above.
ja_jp: プライベートメールのセットを返します。前の例と同様に `Uni` を使用する必要はありませんが、 `Uni` を使用する方が、このメソッドを呼び出して `Uni` レスポンスを返す上記の `GitHubProfileService` JAX-RS リソースの JAX-RS メソッドとの親和性が高くなります。

source: Return in case of exception
ja_jp: 例外が発生時にリターンする

source: Return or produce a `BuildTimeActionBuildItem`.
ja_jp: `BuildTimeActionBuildItem` を返すか、生成します。

source: Return or use a BuildProducer to create a `BuildTimeActionBuildItem`
ja_jp: BuildProducer を返す、または使用して、 `BuildTimeActionBuildItem` を作成します

source: Return the HTML form with a hidden form field containing a CSRF token created by the CSRF filter.
ja_jp: CSRFフィルターによって作成されたCSRFトークンを含むhiddenフォームフィールドを持つHTMLフォームを返します。

source: Return the Multi that will stream jokes
ja_jp: jokes をストリーミングする Multi を返します。

source: Return the claim verification error description.
ja_jp: クレーム検証エラーの説明を返します。

source: Return the response. This response is sent back to the `VertxResource` class
ja_jp: レスポンスを返します。このレスポンスは `VertxResource` クラスに返されます。

source: Return the same UUID to the client.
ja_jp: 同じ UUID をクライアントに返します。

source: Return type
ja_jp: 戻り値の型

source: Returning Multis
ja_jp: Multi を返す

source: Returning Unis
ja_jp: Uni を返す

source: Returning `Unis` is convenient when using a reactive client:
ja_jp: リアクティブクライアントを使用している場合、 `Unis` を返すと便利です。

source: Returning a `Uni<Void>` produces a 204 response (no content).
ja_jp: `Uni<Void>` を返すと 204 レスポンス (コンテンツなし) が生成されます。

source: Returning a response body
ja_jp: レスポンスボディを返す

source: Returning data from some recorded value
ja_jp: 記録された値からデータを返す

source: Returning multiple JSON objects
ja_jp: 複数のJSONオブジェクトの返却

source: Returning results
ja_jp: 結果を返す

source: Returns the hash in Modular Crypt Format (MCF), which includes the algorithm identifier, cost parameter, salt, and hash.
ja_jp: アルゴリズム識別子、コストパラメーター、ソルト、およびハッシュを含むモジュラー暗号形式 (MCF) でハッシュを返します。

source: Returns the stream (_Reactive Stream_)
ja_jp: ストリーム (_Reactive Stream_) を返します。

source: Returns the value `1234`.
ja_jp: 値 `1234` を返します。

source: Reuse existing Go libraries: No need to reimplement CEL in Java, 1:1 mapping with original Go code
ja_jp: 既存の Go ライブラリーの再利用: Java で CEL を再実装する必要がなく、オリジナルの Go コードと 1:1 で対応します。

source: Reusing Dev Service containers across runs
ja_jp: 実行を跨いだDev Servicesコンテナの再利用

source: Reusing Dev Services
ja_jp: Dev Servicesの再利用

source: Reusing containers implies reusing their internal state, including the Elasticsearch schema and the content of indexes.
ja_jp: コンテナの再利用は、Elasticsearch スキーマやインデックスの内容など、 コンテナの内部状態の再利用を意味します。

source: Reusing containers implies reusing their internal state, including the database schema and the content of tables.
ja_jp: コンテナの再利用は、データベーススキーマやテーブルの内容など、コンテナの内部状態の再利用を意味します。

source: Review automatically generated metrics
ja_jp: 自動生成されたメトリクスの確認

source: Review collected metrics
ja_jp: 収集されたメトリクスの確認

source: Review the following documentation before you begin:
ja_jp: 作業を始める前に、次のドキュメントを確認してください。

source: Review the generated metrics:
ja_jp: 生成されたメトリクスを確認します:

source: Review the https://jakarta.ee/specifications/data/1.0/apidocs/jakarta.data/jakarta/data/repository/repository#dataStore()[Javadoc of the `@Repository` annotation] to learn more about the `dataStore` attribute.
ja_jp: `dataStore` 属性の詳細については、 https://jakarta.ee/specifications/data/1.0/apidocs/jakarta.data/jakarta/data/repository/repository#dataStore()[`@Repository` アノテーションの Javadoc] を確認してください。

source: Review the resulting output and fix any issues before you submit your changes in a PR for review.
ja_jp: 変更をPRで提出し、レビューを受ける前に、結果の出力をレビューし、問題があれば修正を行ってください。

source: Review the {quarkus-migration-guide} for items that were not updated by the update command. If your project has such items, implement the additional steps advised in these topics.
ja_jp: updateコマンドで更新されなかった項目については {quarkus-migration-guide} を確認してください。プロジェクトにそのような項目がある場合は、これらのトピックでアドバイスされている追加手順を実行してください。

source: Reviewing PRs quickly, and facilitating contributions.
ja_jp: PRを迅速にレビューし、貢献を促進すること。

source: Reviews for code and documentation have different (but overlapping) participants. To simplify collaborative review, either isolate changes to docs in separate PRs or ensure that a PR has a single focused purpose. For example:
ja_jp: コードとドキュメントのレビューには、さまざまな参加者 (重複する場合もある) がいます。 共同レビューを簡素化するには、ドキュメントへの変更を別々の PR に分離するか、PR の目的が 1 つに絞られていることを確認します。例:

source: Reviews for code and documentation have different (but overlapping) participants. To simplify collaborative review, either isolate changes to docs in their own PRs, or ensure that the PR has a single, focused purpose For example:
ja_jp: コードおよびドキュメントのレビューには、異なる (しかし重複する) 参加者がいます。共同レビューを簡単にするために、ドキュメントへの変更を独自の PR に分離するか、PR が確実に単一の焦点を絞った目的を持つようにください。たとえば、以下のようになります。

source: Revise the Javadoc in the extension
ja_jp: エクステンションのJavadocを改訂する

source: Revoke OIDC tokens
ja_jp: OIDC トークンの失効

source: Revoke the authorization code flow access token.
ja_jp: 認可コードフローのアクセストークンを取り消します。

source: Revoke the authorization code flow refresh token.
ja_jp: 認可コードフローのリフレッシュトークンを取り消します。

source: Revoke tokens if an RP-initiated logout event is observed.
ja_jp: RP-initiated ログアウトイベントが観測された場合、トークンを取り消します。

source: Revoking Access Tokens
ja_jp: アクセストークンの失効

source: Revoking access tokens
ja_jp: アクセストークンを失効する

source: Rewriting tests to use the different mocking approaches, including the new (at the time) https://quarkus.io/blog/quarkus-test-profiles/[QuarkusTest profiles].
ja_jp: （当時における）新しい link:https://quarkus.io/blog/quarkus-test-profiles/[QuarkusTestのプロファイル]を含む、さまざまなモッキングアプローチを使用するためのテストの書き換え。

source: Rich Authorization Requests
ja_jp: リッチ認可リクエスト

source: Rich Dev UI
ja_jp: リッチ Dev UI

source: Riding Camel Quarkus: effortless APIs
ja_jp: Camel Quarkusに乗る：容易なAPI

source: Right-click and select `Edit Thread Activity Lanes...`.
ja_jp: 右クリックして `Edit Thread Activity Lanes...` を選択します。

source: Risk of pinning, monopolization and under-efficient object pooling
ja_jp: ピニング、独占、効率の悪いオブジェクトプーリングのリスク

source: Roadmap
ja_jp: ロードマップ

source: Robust Policy Management: Developing comprehensive frameworks for defining and enforcing catalog access policies and permissions, a core capability for multi-tenant catalog deployments.
ja_jp: 堅牢なポリシー管理：マルチテナントカタログデプロイメントの中核機能である、カタログアクセスポリシーと権限を定義および適用するための包括的なフレームワークを開発します。

source: Role `root` will be able to access `/secured/user/\*` and `/secured/admin/*` paths.
ja_jp: ロール `root` は、 `/secured/user/\*` および `/secured/admin/*` パスにアクセスできるようになります。

source: Role claim path
ja_jp: ロールクレームパス

source: Role claim separator
ja_jp: ロールクレームセパレーター

source: Role of Keycloak in resource permissions
ja_jp: リソース権限における Keycloak のロール

source: Role-based access control
ja_jp: ロールベースのアクセス制御

source: Role-based access control with Keycloak
ja_jp: Keycloak によるロールベースのアクセス制御

source: Roles are mapped from one of the claims of the introspection endpoint response. By default, it's the `scope` claim. Roles are obtained by splitting the claim with a space separator. If the claim is an array, no splitting is done, the roles are obtained from the array.
ja_jp: ロールは、イントロスペクションのエンドポイントレスポンスのクレームの1つからマッピングされます。デフォルトでは、 `scope` クレームです。ロールはクレームをスペース区切りで分割して取得します。クレームが配列の場合、分割は行われず、ロールは配列から取得されます。

source: Roles mapping
ja_jp: ロールマッピング

source: Room
ja_jp: 教室

source: Root access on target system
ja_jp: ターゲットシステムへのルートアクセス

source: Root logger configuration
ja_jp: ルートロガーの設定

source: Roughly 15 minutes
ja_jp: 約15分

source: Roughly {prerequisites-time}
ja_jp: ざっと {prerequisites-time}

source: Route all traffic to our tasks application
ja_jp: すべてのトラフィックをタスクアプリケーションにルーティング

source: Route order constants defined in `io.quarkus.vertx.http.runtime.RouteConstants` and known extensions:
ja_jp: `io.quarkus.vertx.http.runtime.RouteConstants` で定義されているルート順定数および既知の拡張：

source: Route order value
ja_jp: ルートオーダー値

source: Route order values are the values that are specified via Vert.x route `io.vertx.ext.web.Route.order(int)` function.
ja_jp: ルートオーダーの値は、Vert.x のルート `io.vertx.ext.web.Route.order(int)` 関数で指定される値です。

source: Route that enforces the upload body size limit.
ja_jp: アップロードボディのサイズ制限を実施するルート。

source: Route with priority over the default route (add an offset from this value).
ja_jp: デフォルトルートよりも優先されるルート（この値からオフセットを追加する）。

source: Route without priority over the default route (add an offset from this value)
ja_jp: デフォルトルートより優先されないルート（この値からオフセットを追加）

source: Rule Unit a central paradigm introduced in Drools 8 that helps users to encapsulate the set of rules and the facts against which those rules will be matched; you can read more information in the https://www.drools.org/learn/documentation.html[Drools documentation].
ja_jp: ルールユニットは、Drools 8 で導入された中心的なパラダイムであり、ユーザーがルールのセットとそれらのルールが照合される事実をカプセル化するのに役立ちます。詳細は、 https://www.drools.org/learn/documentation.html[Drools ドキュメント] を参照してください。

source: Run
ja_jp: 実行

source: Run <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">dev mode</a> remotely with changes to local files immediately available in a containerize environment.
ja_jp: <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">開発モード</a>をリモートで実行し、ローカルファイルへの変更をコンテナ化環境ですぐ利用出来るようにします。

source: Run @Scheduled methods on virtual threads
ja_jp: 仮想スレッド上で @Scheduled メソッドを実行

source: Run Neo4j cypher queries against the graph database to understand the call paths in the Quarkus application.
ja_jp: Quarkusアプリケーションのコールパスを理解するためにグラフデータベースに対してNeo4jサイファークエリを実行

source: Run `mvn clean install` in the extension root (or just `runtime`).
ja_jp: エクステンションのルート (または単に `runtime` ) で `mvn clean install` を実行します。

source: Run `mvn clean package` and then `java -jar ./target/cassandra-quarkus-quickstart-*-runner.jar` to start the application;
ja_jp: `mvn clean package` を実行してから、 `java -jar./target/cassandra-quarkus-quickstart-*-runner.jar` を実行してアプリケーションを起動します。

source: Run `mvn verify`, the tests will be run and the results will end up in `target/jacoco-reports`. This is all that is needed, the `quarkus-jacoco` extension allows JaCoCo to just work out of the box.
ja_jp: `mvn verify` を実行すると、テストが実行され、その結果が `target/jacoco-reports` に出力されます。 `quarkus-jacoco` のエクステンションを使えば、これだけでJacoco はすぐに動作します。

source: Run `mvn verify`, the tests will be run and the results will end up in `target/jacoco-reports`. This is all that is needed, the `quarkus-jacoco` extension allows Jacoco to just work out of the box.
ja_jp: `mvn verify` を実行すると、テストが実行され、その結果が `target/jacoco-reports` に反映されます。必要なのはこれだけで、 `quarkus-jacoco` のエクステンションを使えば、Jacoco はすぐに動作します。

source: Run `quarkus build --clean` to perform clean as part of the build.
ja_jp: ビルドの一部として clean を実行するには、 `quarkus build --clean` を実行します。

source: Run `quarkus dev --clean` to perform clean as part of the build.
ja_jp: ビルドの一部として clean を実行するには、 `quarkus dev --clean` を実行します。

source: Run a Neo4j graph database within a container
ja_jp: コンテナ内でのNeo4jグラフ・データベースの実行

source: Run an embedded Infinispan data grid server for distributed caching
ja_jp: 分散キャッシュ用の埋め込みInfinispanデータグリッドサーバーを実行する

source: Run an integration test
ja_jp: 統合テストの実行

source: Run application using virtual threads
ja_jp: 仮想スレッドを使用したアプリケーションの実行

source: Run code on virtual threads using @RunOnVirtualThread
ja_jp: @RunOnVirtualThread を使用した仮想スレッド上でのコード実行

source: Run configurations have been renamed to `Quarkus Dev Mode`, to minimize confusion with IntelliJ Ultimate's built-in Quarkus support.
ja_jp: IntelliJ Ultimateに組み込まれたQuarkusサポートとの混同を避けるため、実行設定の名前が `Quarkus Dev Mode` に変更されました。

source: Run integration tests to train the AOT cache
ja_jp: AOT キャッシュをトレーニングするために統合テストを実行する

source: Run locally in Azure Functions local environment
ja_jp: Azure Functionsローカル環境での実行

source: Run modes
ja_jp: 実行モード

source: Run scheduled methods on virtual threads
ja_jp: 仮想スレッド上でスケジュールされたメソッドを実行

source: Run the Application Locally
ja_jp: アプリケーションをローカルで実行する

source: Run the Application in JVM mode
ja_jp: JVM モードでアプリケーションを実行する

source: Run the Getting Started Application
ja_jp: 入門アプリケーションの実行

source: Run the TLS registry Let's Encrypt CLI `prepare` command:
ja_jp: TLS レジストリー Let's Encrypt CLI の `prepare` コマンドを実行します。

source: Run the Vale linter for `*.adoc` files that match the regular expression (Java Pattern syntax). Include errors in the results.
ja_jp: 正規表現（Java Pattern構文）に一致する `*.adoc` ファイルに対して、Vale linterを実行します。結果にはエラーが含まれます。

source: Run the Vale linter for all `*.adoc` files in the `src/main/asciidoc` directory of the `docs` module. Include suggestions, warnings, and errors in the results.
ja_jp: `docs` モジュールの `src/main/asciidoc` ディレクトリにあるすべての `*.adoc` ファイルに対して Vale linter を実行します。結果には提案、警告、エラーが含まれます。

source: Run the Vale linter for any modified `*.adoc` files in the `docs` module (`git status`). Include warnings and errors in the results.
ja_jp: `docs` モジュール内の変更された `*.adoc` ファイル ( `git status` )に対して Vale linter を実行します。結果には警告とエラーが含まれます。

source: Run the `QuarkusApplication` main method
ja_jp: `QuarkusApplication` mainメソッドの実行

source: Run the application
ja_jp: アプリケーションの実行
